filipesfreitas/Repo-Aulas-Micro/referencias_software_msp430/MSP430Ware_3_60_00_10/captivate/example_projects/CaptivateDesignCenterWorkspace/CAPTIVATE-PHONE/demo_src/captivate/BASE/CAPT_HAL.h
//*****************************************************************************
//
//!  Clear the CapTIvate&tm; counter interval.
//!
//!  \par Parameters
//!		none
//!  \par Returns
//!		none
//
//*****************************************************************************
extern void CAPT_clearCCounter(void);

//*****************************************************************************
//
//!  Start (enable) the CapTIvate&tm; counter interval.
//!
//!  \par Parameters
//!		none
//!  \par Returns
//!		none
//
//*****************************************************************************
extern void CAPT_startCCounter(void);

//*****************************************************************************
//
//!  Stop (disable) the CapTIvate&tm; counter interval.
//!
//!  \par Parameters
//!		none
//!  \par Returns
//!		none
//
//*****************************************************************************
extern void CAPT_stopCCounter(void);


//*****************************************************************************
//
//!  Select the input divider to the CapTIvate&tm; timer.
//!
//!  \param sourceDiv = time source divider
//!  \par Returns
//!		none
//
//*****************************************************************************
extern void CAPT_selectTimerSourceDivider(uint8_t sourceDiv);

//*****************************************************************************
//
//!  Select the input source to the CapTIvate&tm; timer.
//!
//!  \param source = timer source selection
//!  \par Returns
//!		none
//
//*****************************************************************************
extern void CAPT_selectTimerSource(uint8_t source);

//*****************************************************************************
//
//!  Enable measurements to be triggered from CapTIvate&tm; timer.
//!  Set CAPTCCTRL0:CAPTCONV
//!
//!  \par Parameters
//!		none
//!  \par Returns
//!		none
//
//*****************************************************************************
extern void CAPT_enableTimerTrigMeasurement(void);

//*****************************************************************************
//
//!  Disable measurements to be triggered from CapTIvate&tm; timer.
//!  Clear CAPTCCTRL0:CAPTCONV
//!
//!  \par Parameters
//!		none
//!  \par Returns
//!		none
//
//*****************************************************************************
extern void CAPT_disableTimerTrigMeasurement(void);


//*****************************************************************************
//
//!  Clear the CapTIvate&tm; timer.
//!
//!  \par Parameters
//!		none
//!  \par Returns
//!		none
//
//*****************************************************************************
extern void CAPT_clearTimer(void);

//*****************************************************************************
//
//!  Start (enable) the CapTIvate&tm; timer.
//!
//!  \par Parameters
//!		none
//!  \par Returns
//!		none
//
//*****************************************************************************
extern void CAPT_startTimer(void);

//*****************************************************************************
//
//!  Stop (disable) the CapTIvate&tm; timer.
//!
//!  \par Parameters
//!		none
//!  \par Returns
//!		none
//
//*****************************************************************************
extern void CAPT_stopTimer(void);

//*****************************************************************************
//
//!  Stop (disable) the CapTIvate&tm; timer.
//!
//!  \par Parameters
//!		none
//!  \return timer contents
//
//*****************************************************************************
extern uint16_t CAPT_readTimerRegister(void);

//*****************************************************************************
//
//!  Read value from timer compare register.
//!
//!  \par Parameters
//!		none
//!  \return Compare Register Value
//
//*****************************************************************************
extern uint16_t CAPT_readTimerCompRegister(void);

//*****************************************************************************
//
//!  Write value into timer compare register.
//!
//!  \param  compRegister = Compare Register Value
//!  \par Returns
//!		none
//
//*****************************************************************************
extern void CAPT_writeTimerCompRegister(uint16_t compRegister);

//*****************************************************************************
//
//!  Turn off the CapTIvate&tm; IP.
//!
//!  \par Parameters
//!		none
//!  \return Compare Register Value
//
//*****************************************************************************
extern void CAPT_powerOff(void);

//*****************************************************************************
//
//!  Turn on the CapTIvate&tm; IP.
//!
//!  \par Parameters
//!		none
//!  \return Compare Register Value
//
//*****************************************************************************
extern void CAPT_powerOn(void);

//*****************************************************************************
//
//!  Activate specific IO channel, CAPx.y, ui8Block-> x, ui8Pin->y.  When a
//!  conversion is started then this IO will enter either a Tx or Rx mode of
//!  operation.
//!
//!  \param ui8Block = select block
//!  \param ui8Pin = select pin
//!  \par Returns
//!		none
//
//*****************************************************************************
extern void CAPT_setChannelActive(uint8_t ui8Block, uint8_t ui8Pin);

//*****************************************************************************
//
//!  Enable a specific IO channel, CAPx.y, ui8Block-> x, ui8Pin->y.
//!
//!  \param ui8Block = select block
//!  \param ui8Pin = select pin
//!  \par Returns
//!		none
//
//*****************************************************************************
extern void CAPT_setChannelEnable(uint8_t ui8Block, uint8_t ui8Pin);

//*****************************************************************************
//
//!  Set off state for specific IO channel, CAPx.y, ui8Block-> x, ui8Pin->y.
//!  This puts the IO into the Ground state when enabled and not active.
//!
//!  \param ui8Block = select block
//!  \param ui8Pin = select pin
//!  \par Returns
//!		none
//
//*****************************************************************************
extern void CAPT_setChannelOffState(uint8_t ui8Block, uint8_t ui8Pin);

//*****************************************************************************
//
//!  Set on state for specific IO channel, CAPx.y, ui8Block-> x, ui8Pin->y.
//!  This puts the IO into the Rx mode.  The mode, mutual or self, is defined
//!  by the sensor parameter tSensor.SensingMethod and applied by API
//!  CAPT_apply_SensorParams.  The default setting for the block is self mode.
//!
//!  \param ui8Block = select block
//!  \param ui8Pin = select pin
//!  \par Returns
//!		none
//
//*****************************************************************************
extern void CAPT_setChannelOnState(uint8_t ui8Block, uint8_t ui8Pin);

//*****************************************************************************
//
//!  Activate a specific IO channel, CAPx.y, ui8Block-> x, ui8Pin->y.
//!
//!  \param ui8Block = select block
//!  \param ui8Pin = select pin
//!  \par Returns
//!		none
//
//*****************************************************************************
extern void CAPT_clearChannelActive(uint8_t ui8Block, uint8_t ui8Pin);


//*****************************************************************************
//
//!  Enable a specific IO channel, CAPx.y, ui8Block-> x, ui8Pin->y.
//!
//!  \param ui8Block = select block
//!  \param ui8Pin = select pin
//!  \par Returns
//!		none
//
//*****************************************************************************
extern void CAPT_clearChannelEnable(uint8_t ui8Block, uint8_t ui8Pin);

//*****************************************************************************
//
//!  Clear off state for specific IO channel, CAPx.y, ui8Block-> x, ui8Pin->y.
//!
//!  \param ui8Block = select block
//!  \param ui8Pin = select pin
//!  \par Returns
//!		none
//
//*****************************************************************************
extern void CAPT_clearChannelOffState(uint8_t ui8Block, uint8_t ui8Pin);

//*****************************************************************************
//
//!  Set on state for specific IO channel, CAPx.y, ui8Block-> x, ui8Pin->y.
//!
//!  \param ui8Block = select block
//!  \param ui8Pin = select pin
//!  \par Returns
//!		none
//
//*****************************************************************************
extern void CAPT_clearChannelOnState(uint8_t ui8Block, uint8_t ui8Pin);

//*****************************************************************************
//
//!  Write Coarse Gain value to Block Compensation.
//!
//!  \param ui8Block = select block
//!  \param ui8Value = value
//!  \par Returns
//!		none
//
//*****************************************************************************
extern void CAPT_writeCoarseGain(uint8_t ui8Block, uint8_t ui8Value);

//*****************************************************************************
//
//!  Read Coarse Gain value from Block Compensation.
//!
//!  \param ui8Block = select block
//!  \return 8-bit coarse gain value
//
//*****************************************************************************
extern uint8_t CAPT_readCoarseGain(uint8_t ui8Block);

//*****************************************************************************
//
//!  Write Fine Gain value to Block Compensation.
//!
//!  \param ui8Block = select block
//!  \param ui8Value = value
//!  \par Returns
//!		none
//
//*****************************************************************************
extern void CAPT_writeFineGain(uint8_t ui8Block, uint8_t ui8Value);

//*****************************************************************************
//
//!  Read Fine Gain value from Block Compensation.
//!
//!  \param ui8Block = select block
//!  \return 8-bit fine gain value
//
//*****************************************************************************
extern uint8_t CAPT_readFineGain(uint8_t ui8Block);

//*****************************************************************************
//
//!  Write Offset Tap value to Block Compensation.
//!
//!  \param ui8Block = select block
//!  \param ui16Value = offsetvalue
//!  \par Returns
//!		none
//
//*****************************************************************************
extern void CAPT_writeOffsetTap(uint8_t ui8Block, uint16_t ui16Value);

//*****************************************************************************
//
//!  Read Offset Tap value from Block Compensation.
//!
//!  \param ui8Block = select block
//!  \return 16-bit offset tap value
//
//*****************************************************************************
extern uint16_t CAPT_readOffsetTap(uint8_t ui8Block);

//*****************************************************************************
//
//!  Read Conversion value from Block.
//!
//!  \param ui8Block = select block
//!  \return 16-bit conversion value
//
//*****************************************************************************
extern uint16_t CAPT_readConversion(uint8_t ui8Block);


//*****************************************************************************
//
//!  Set CAPLPMCFG.
//!
//!  \par Parameters
//!		none
//!  \par Returns
//!		none
//
//*****************************************************************************
extern void CAPT_setCAPLPMCFG(void);

//*****************************************************************************
//
//!  Clear CAPLPMCFG.
//!
//!  \par Parameters
//!		none
//!  \par Returns
//!		none
//
//*****************************************************************************
extern void CAPT_clearCAPLPMCFG(void);

//*****************************************************************************
//
//!  Poll a CapTIvate&tm; peripheral interrupt flag.
//!
//!  \param ui16InterruptMask is a bit mask of the interrupts to test.
//!	
//!  \return interrupt flags that are set
//
//*****************************************************************************
extern uint16_t CAPT_pollIFG(uint16_t ui16InterruptMask);

//*****************************************************************************
//
//!  Clear a Captivate peripheral interrupt flag.  The bit mask is defined as:
//!  BIT0 -> End Of Conversion IFG
//!  BIT1 -> Detection IFG
//!  BIT2 -> CapTIvate Timer IFG (number of clock cycles)
//!  BIT3 -> CapTIvate Counter IFG (number of conversion cycles)
//!
//!  BIT8 -> Maximum Count Error IFG
//!
//!  \param ui16InterruptMask is a bit mask of the interrupt flags to clear.
//!		
//!  \return none.
//
//*****************************************************************************
extern void CAPT_clearIFG(uint16_t ui16InterruptMask);

//*****************************************************************************
//
//!  Retreive the CapTIvate&tm; peripheral interrupt vector register
//!
//!  \param none.
//!	
//!  \return current value of the CapTIvate&tm; IV register.
//
//*****************************************************************************
extern uint16_t CAPT_getInterruptVector(void);

//*****************************************************************************
//
//!  Enable a CapTIvate IO to be a shield.
//!
//!  \param ui8Block is the CapTIvate block that the shield resides on.
//!  \param ui8Pin is the pin on the block that the shield is connected to.
//!	
//!  \returns
//!      None.
//
//*****************************************************************************
extern void CAPT_enableShieldIO(uint8_t ui8Block, uint8_t ui8Pin);

//*****************************************************************************
//
//!  Disable a CapTIvate shield IO.
//!
//!  \param ui8Block is the CapTIvate block that the shield resides on.
//!  \param ui8Pin is the pin on the block that the shield is connected to.
//!	
//!  \returns
//!      None.
//
//*****************************************************************************
extern void CAPT_disableShieldIO(uint8_t ui8Block, uint8_t ui8Pin);

#endif /* CAPT_HAL_H_ */
//*****************************************************************************
//! Close the doxygen group
//! @}
//*****************************************************************************
